app/controllers/events_controller.rb

SELECT * FROM `events` WHERE (starttime >= 'Sun Feb 28 00:00:00 +0530 2010' and endtime <= 'Sun Apr 11 00:00:00 +0530 2010')
---
  def get_events
    @events = Event.find(:all, :conditions => ["starttime >= '#{Time.at(params['start'].to_i).to_formatted_s(:db)}' and endtime <= '#{Time.at(params['end'].to_i).to_formatted_s(:db)}'"] )

SELECT * FROM `events` WHERE (`events`.`id` = '1006') LIMIT 1
UPDATE `events` SET `updated_at` = '2010-03-17 11:16:35', `all_day` = 0, `endtime` = '2010-03-19 08:00:29', `starttime` = '2010-03-19 07:30:29' WHERE `id` = 1004
---
  def move
    @event = Event.find_by_id params[:id]
    if @event
      @event.starttime = (params[:minute_delta].to_i).minutes.from_now((params[:day_delta].to_i).days.from_now(@event.starttime))
      @event.endtime = (params[:minute_delta].to_i).minutes.from_now((params[:day_delta].to_i).days.from_now(@event.endtime))
      @event.all_day = params[:all_day]
      @event.save

SELECT * FROM `events` WHERE (`events`.`id` = '1005') LIMIT 1
UPDATE `events` SET `updated_at` = '2010-03-17 11:49:04', `endtime` = '2010-03-16 09:32:29' WHERE `id` = 1005
---
  def resize
    @event = Event.find_by_id params[:id]
    if @event
      @event.endtime = (params[:minute_delta].to_i).minutes.from_now((params[:day_delta].to_i).days.from_now(@event.endtime))
      @event.save

SELECT * FROM `events` WHERE (`events`.`id` = '1003') LIMIT 1
UPDATE `events` SET `updated_at` = '2010-03-17 11:11:00', `starttime` = '2010-03-14 07:02:29' WHERE `id` = 1006
---
  def update
    @event = Event.find_by_id(params[:event][:id])
    @event.attributes = params[:event]
    @event.save